app/views/orders/show.html.erb

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT 1  [["id", nil]]
---
  <strong>Food:</strong>
  <%= Food.find(@order.food_id).name %>