app/controllers/foods_controller.rb

  def index
    if params[:menu_id] && params[:id]
      @menu = Menu.find(params[:menu_id])
      @food = @menu.foods.find(params[:id])
---
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "foods".* FROM "foods" WHERE "foods"."menu_id" = $1 AND "foods"."id" = $2 LIMIT 1  [["menu_id", 2], ["id", 2]]