app/controllers/menus_controller.rb

  def index
    @menus = Menu.all
    @current_menu = params[:query] || 1
    @search = params[:search] || 'menu'

    order = params[:sort] || 'name ASC'
    if(@search != 'search')
      @food = Menu.find(@current_menu).foods.order(order)
---
SELECT "menus".* FROM "menus"
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."menu_id" = $1  ORDER BY price DESC  [["menu_id", 1]]

  def create
    @menu = Menu.new(menu_params)

    respond_to do |format|
      if @menu.save
---
INSERT INTO "menus" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Breakfast"], ["description", "Delicious food we have after waking up"], ["created_at", "2015-12-06 04:38:44.278502"], ["updated_at", "2015-12-06 04:38:44.278502"]]

    def set_menu
      @menu = Menu.find(params[:id])
---
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT 1  [["id", 1]]