app/controllers/orders_controller.rb

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT 1  [["id", 13]]
---
  def new
    food_id = params[:food]
    if food_id
      @food = Food.find food_id

INSERT INTO "orders" ("name", "address", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Blue"], ["address", "75 LeLai"], ["phone", "09090999"], ["created_at", "2015-12-06 15:41:55.472835"], ["updated_at", "2015-12-06 15:41:55.472835"]]
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save